src/cf/maERP_ib/src/DataProcessors/ЛичныйКабинетПартнера/ЛичныйКабинетПартнера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЛичныйКабинетПартнера</name>
  <tabularSections>
    <name>Корзина</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаЗаказов</name>
    <attributes>
      <name>ДокументЗаказа</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КнопкаРазвернуть</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КнопкаПовтора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Развернуто</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаЗаявок</name>
    <attributes>
      <name>ДокументЗаявки</name>
      <type>
        <types>DocumentRef.ЗаявкаНаПоискТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаявки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/cf/maERP_ib/src/InformationRegisters/ПрисоединённыеФайлы/ПрисоединённыеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрисоединённыеФайлы</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Внешний</name>
    <comment>Признак хранения файла на диске</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>DefinedType.КоличествоНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладельцыПрисоединенныхФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Связь</name>
    <comment>Связь со внутренним реквизитом объекта</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор файла, так же служит для связи c файлом на диске</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/InformationRegisters/ИсторияПоискаВЛКП/ИсторияПоискаВЛКП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияПоискаВЛКП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТекстПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/maERP_ib/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/maERP_ib/src/DataProcessors/ЛичныйКабинетПартнера/Forms/ФормаНоменклатура/Module.bsl
// +GAN  29/10/2025
#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("ВидЦены", ПараметрыСеанса.Контрагент.ТипЦены);
	Этаформа.Заголовок = Нстр("ru = ""Личный кабинет ""; fr = ""Cabinet privé""") + 
	ПараметрыСеанса.Контрагент;
	Если ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Организация) тогда
		Этаформа.Заголовок = Этаформа.Заголовок + Нстр("ru = "" от ""; fr = "" de """)+
		ПараметрыСеанса.Пользователь.Организация;
	КонецЕсли;
	ПользовательЛПК = ПараметрыСеанса.Пользователь;    
	
	ТаблицаГруппЛКП = ПолучитьТаблицуГруппЛКП();
	МассивПорций = ПорционироватьКоллекцию(ТаблицаГруппЛКП,1);
	
Если ТаблицаГруппЛКП.Количество() = 0 тогда иначе   
		
			ГруппаКнопок = Элементы.ГруппаКнопок;    
			ГруппаКнопок.РастягиватьПоГоризонтали = Ложь;   
			ГруппаКнопок.Заголовок = Нстр("fr = 'Filtre de marchandises'; ru = 'Фильтр номенклатуры'; en = 'Item Filter'; es = 'Filtro de artículos'"); 

				
			ДобавляемыеРеквизиты = Новый Массив; 
			НовыйРеквизит = Новый РеквизитФормы("КартинкаВсе",Новый ОписаниеТипов("Строка"));  
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);        
			НовыйРеквизит = Новый РеквизитФормы("гр_НаимВсе",Новый ОписаниеТипов("Строка"));  
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);        
			ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);	  
			
			
			ГруппаКнопокА1 = ЭтаФорма.Элементы.Добавить("ГруппаКнопокА1", Тип("ГруппаФормы"),ГруппаКнопок);
			ГруппаКнопокА1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКнопокА1.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКнопокА1.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаКнопокА1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
			ГруппаКнопокА1.ЦветФона = цветастиля.ЦветФонаФормы;   
			ГруппаКнопокА1.РастягиватьПоВертикали = Ложь;
			ГруппаКнопокА1.РастягиватьПоГоризонтали = Ложь; 
			ГруппаКнопокА1.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ГруппаКнопокА1.Ширина = 11;
			ГруппаКнопокА1.Высота = 5; 
			
			ГруппаКнопокА2 = ЭтаФорма.Элементы.Добавить("ГруппаКнопокА2", Тип("ГруппаФормы"),ГруппаКнопокА1);
			ГруппаКнопокА2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКнопокА2.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКнопокА2.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаКнопокА2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
			ГруппаКнопокА2.ЦветФона = цветастиля.ЦветФонаФормы;
			ГруппаКнопокА2.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ГруппаКнопокА2.Ширина = 10;
			ГруппаКнопокА2.Высота = 4;   
			ГруппаКнопокА2.РастягиватьПоВертикали = Ложь;
			ГруппаКнопокА2.РастягиватьПоГоризонтали = Ложь; 

			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("КартинкаВсе", Тип("ПолеФормы"),ГруппаКнопокА2);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;   
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.ПутьКДанным = "КартинкаВсе";
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
			НовыйЭлемент.РазмерКартинки = РазмерКартинки.Пропорционально;
			НовыйЭлемент.Ширина = 10;
			НовыйЭлемент.Высота = 4;    
			НовыйЭлемент.Шрифт = Новый Шрифт(, 12, Истина, , , ) ;
			НовыйЭлемент.Гиперссылка = Истина;            
			НовыйЭлемент.Рамка= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки); 
			НовыйЭлемент.Подсказка = Нстр("fr = 'Tous les produits'; ru = 'Весь товар'; en = 'All the goods'; es = 'Toda la mercancía'");
			НовыйЭлемент.УстановитьДействие("Нажатие","НажатиеПиктоГраммыКоманда");
		
			
			ЭтотОбъект["КартинкаВсе"] = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Total,новый УникальныйИдентификатор);
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("гр_НаимВсе", Тип("ПолеФормы"),ГруппаКнопокА2);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.МногострочныйРежим = Ложь;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.ПутьКДанным = "гр_НаимВсе";
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
            НовыйЭлемент.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;  
			новыйЭлемент.Доступность = Ложь;
			НовыйЭлемент.Ширина = 10;
			ЭтотОбъект["гр_НаимВсе"]	= Нстр("en = 'All'; es = 'Eso es todo'; fr = 'Total'; ru = 'Все'");			
	
	сч = 0;  
	сч1 = 0;
	Для каждого масс1 из МассивПорций цикл
		сч = сч + 1;	
		сч1 = сч1 + 10;	
		Для каждого группаЛКП из масс1 цикл  
			сч1 = сч1 + 1;	
			ГруппаКнопокА1 = ЭтаФорма.Элементы.Добавить("ГруппаКнопокА1"+СокрЛП(группаЛКП.ГруппаЛКП.Код), Тип("ГруппаФормы"),ГруппаКнопок);
			ГруппаКнопокА1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКнопокА1.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКнопокА1.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаКнопокА1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
			ГруппаКнопокА1.ЦветФона = цветастиля.ЦветФонаФормы;   
			ГруппаКнопокА1.РастягиватьПоВертикали = Ложь;
			ГруппаКнопокА1.РастягиватьПоГоризонтали = Ложь; 
			ГруппаКнопокА1.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			ГруппаКнопокА1.Ширина = 11;
			ГруппаКнопокА1.Высота = 5; 
			
			ГруппаКнопокА2 = ЭтаФорма.Элементы.Добавить("ГруппаКнопокА2"+СокрЛП(группаЛКП.ГруппаЛКП.Код), Тип("ГруппаФормы"),ГруппаКнопокА1);
			ГруппаКнопокА2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКнопокА2.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаКнопокА2.ОтображатьЗаголовок = ЛОЖЬ; 
			ГруппаКнопокА2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
			ГруппаКнопокА2.ЦветФона = цветастиля.ЦветФонаФормы;
			ГруппаКнопокА2.Ширина = 10;
			ГруппаКнопокА2.Высота = 4;   
			ГруппаКнопокА2.РастягиватьПоВертикали = Ложь;
			ГруппаКнопокА2.РастягиватьПоГоризонтали = Ложь; 
			ГруппаКнопокА2.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			
			
			ДобавляемыеРеквизиты = Новый Массив; 
			НовыйРеквизит = Новый РеквизитФормы("Картинка"+СокрЛП(группаЛКП.ГруппаЛКП.Код),Новый ОписаниеТипов("Строка"));  
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);        
			НовыйРеквизит = Новый РеквизитФормы("Надпись"+СокрЛП(группаЛКП.ГруппаЛКП.Код),Новый ОписаниеТипов("Строка"));  
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);        
			ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);	  
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Картинка"+СокрЛП(группаЛКП.ГруппаЛКП.Код), Тип("ПолеФормы"),ГруппаКнопокА2);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;   
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.ПутьКДанным = "Картинка"+СокрЛП(группаЛКП.ГруппаЛКП.Код);
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
			НовыйЭлемент.РазмерКартинки = РазмерКартинки.Пропорционально;   
			НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			НовыйЭлемент.Ширина = 10;
			НовыйЭлемент.Высота = 4;
			НовыйЭлемент.Гиперссылка = Истина;            
			НовыйЭлемент.Рамка= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки); 
			НовыйЭлемент.Подсказка = СокрЛП(группаЛКП.ГруппаЛКП.Наименование);
			НовыйЭлемент.УстановитьДействие("Нажатие","НажатиеПиктоГраммыКоманда"); 
			
			Если группаЛКП.ГруппаЛКП.Картинка.Получить() = Неопределено тогда
				ЭтотОбъект["Картинка"+СокрЛП(группаЛКП.ГруппаЛКП.Код)]	= ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ПустаяКартинка,новый УникальныйИдентификатор);
			Иначе
				ЭтотОбъект["Картинка"+СокрЛП(группаЛКП.ГруппаЛКП.Код)]	=  ПолучитьНавигационнуюСсылку(группаЛКП.ГруппаЛКП.Ссылка,"Картинка");
			КонецЕсли;
			
			ДобавляемыеРеквизиты = Новый Массив; 
			НовыйРеквизит = Новый РеквизитФормы("гр_Наим"+СокрЛП(группаЛКП.ГруппаЛКП.Код),Новый ОписаниеТипов("Строка"));  
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);        
			
			ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Надпись"+СокрЛП(группаЛКП.ГруппаЛКП.Код), Тип("ПолеФормы"),ГруппаКнопокА2);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.ПутьКДанным = "гр_Наим"+СокрЛП(группаЛКП.ГруппаЛКП.Код);
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
            НовыйЭлемент.ЦветРамки = ЦветаСтиля.ЦветФонаФормы; 
			НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
			новыйЭлемент.Доступность = Ложь;  
			НовыйЭлемент.Ширина = 10;
			
			ЭтотОбъект["гр_Наим"+СокрЛП(группаЛКП.ГруппаЛКП.Код)]	= СокрЛП(группаЛКП.ГруппаЛКП.Наименование);			
			
		КонецЦикла;		
	КонецЦикла;		
	
КонецЕсли; 

	ОтобразимКорзинуИзДинамики();   
	ЗаполнитьТаблицуЗаказов(); 
	ЗаполнитьТаблицуЗаявок(); 
	
	элементы.ПользовательЛПК.Заголовок = Нстр("en = 'Client'; es = 'Cliente'; fr = 'Utilisateur'; ru = 'Пользователь'");
	элементы.ГруппаФото.Заголовок = Нстр("en = 'Selected nomenclature'; es = 'Nomenclatura seleccionada'; fr = 'Article sélectionné'; ru = 'Выбранный элемент'");  
	элементы.ГруппаФото.Подсказка = Нстр("en = 'Selected nomenclature'; es = 'Nomenclatura seleccionada'; fr = 'Article sélectionné'; ru = 'Выбранный элемент'");  
	элементы.ГруппаКорзина.Заголовок = Нстр("en = 'Basket'; es = 'Cesta'; fr = 'Liste de courses'; ru = 'Список покупок'");  
	элементы.ГруппаКорзина.Подсказка = Нстр("en = 'Basket'; es = 'Cesta'; fr = 'Liste de courses'; ru = 'Список покупок'");  
	элементы.Цена.Заголовок = Нстр("en = 'Price'; es = 'Precio'; fr = 'Prix'; ru = 'Цена'");
	элементы.НаименованиеНоменклатуры.Заголовок = Нстр("en = 'Name'; es = 'Denominación'; fr = 'Marchandise'; ru = 'Товар'"); 
	элементы.Поиск.ПодсказкаВвода = Нстр("fr = 'Recherche...'; ru = 'Поиск...'; en = 'Search...'; es = 'Búsqueda...'");
	
	Элементы.ИсторияПокупок.Заголовок = Нстр("en = 'Order history'; es = 'Historial de pedidos'; fr = 'Historique des achats'; ru = 'История покупок'"); 
	Элементы.ИсторияПокупок.Подсказка = Нстр("en = 'List of orders'; es = 'Lista de pedidos'; fr = 'Liste de courses'; ru = 'Список покупок'"); 
	
	Элементы.ОформитьЗаказаПокупателя.Заголовок = Нстр("en = 'Arrange'; es = 'Decorar'; fr = 'Décorer'; ru = 'Украсить'");   
	Командаоформления = Команды.Найти("ОформитьЗаказаПокупателя"); 
    Командаоформления.Подсказка  = Нстр("fr = 'Paiement de la commande'; ru = 'Оформление заказа'; en = 'Making an order'; es = 'Pago'");  
	
	элементы.СписокНоменклатурыАртикул.Заголовок  = Нстр("es = 'Articulo'; fr = 'Article'; ru = 'Артикул'"); 
	элементы.СписокНоменклатурыАртикул.Подсказка  = Нстр("fr = 'Référence du produit'; ru = 'Артикул номенклатуры'; en = 'Article of the nomenclature'; es = 'Artículo nomenclatura'"); 
	элементы.СписокНоменклатурыНаименование.Заголовок  = Нстр("en = 'Nomenclature'; es = 'Nomenclatura'; fr = 'Marchandise'; ru = 'Товар'"); 
	элементы.СписокНоменклатурыНаименование.Подсказка  = Нстр("en = 'Nomenclature'; es = 'Nomenclatura'; fr = 'Marchandise'; ru = 'Товар'"); 
	элементы.СписокНоменклатурыЦена.Заголовок  = Нстр("en = 'Price'; es = 'Precio'; fr = 'Prix'; ru = 'Цена'"); 
	элементы.СписокНоменклатурыЦена.Подсказка  = Нстр("fr = 'Prix du produit'; ru = 'Цена номенклатуры'; en = 'Item price'; es = 'Precio de la línea'"); 
	элементы.СписокНоменклатурыОстаток.Заголовок  = Нстр("en = 'Remains'; es = 'Saldo'; fr = 'Solde'; ru = 'Остаток'"); 
	элементы.СписокНоменклатурыОстаток.Подсказка  = Нстр("fr = 'Solde du produit'; ru = 'Остаток номенклатуры'; en = 'The rest of the nomenclature'; es = 'Resto de la nomenclatura'");
	
	элементы.ТаблицаЗаказовНомерЗаказа.Заголовок  = Нстр("en = 'Number'; es = 'Habitación'; fr = 'Numéro'; ru = 'Номер'"); 
	элементы.ТаблицаЗаказовДатаЗаказа.Заголовок  = Нстр("en = 'Date'; es = 'Fecha'; fr = 'Date'; ru = 'Дата'"); 
	элементы.ТаблицаЗаказовСтатусЗаказа.Заголовок  = Нстр("fr = 'Statut'; ru = 'Статус'; en = 'Status'; es = 'Estatus'"); 
	элементы.ТаблицаЗаказовСумма.Заголовок  = Нстр("fr = 'Somme'; ru = 'Сумма'; en = 'The amount'; es = 'Suma'"); 
	элементы.ТаблицаЗаказовОплачено.Заголовок  = Нстр("fr = 'Pour acquit'; ru = 'Оплачено'; en = 'Paid for'; es = 'Pagado'"); 
	элементы.ТаблицаЗаказовДолг.Заголовок  = Нстр("fr = 'Dette'; ru = 'Долг'; en = 'Debt'; es = 'Deuda'"); 
	
	элементы.ТаблицаЗаказовКнопкаПовтора.Подсказка  = Нстр("fr = 'Remplir le panier avec les marchandises de commande'; ru = 'Заполнить корзину товарами заказа'; en = 'Fill the shopping cart with the order items'; es = 'Llenar el carrito con los productos del pedido'");
	
	Элементы.ГруппаКорзиныСтр3.Заголовок = Нстр("fr = 'Historique des demandes de recherche'; ru = 'История заявок на поиск'; en = 'History of search requests'; es = 'Historial de solicitudes de búsqueda'"); 
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
КонецПроцедуры

&НаСервере
Процедура ОформитьЗаказаПокупателяНаСервере()
	
     Док = Документы.ЗаказПокупателя.СоздатьДокумент();
	 Док.Дата = ТекущаяДата();
	 Док.ДатаОтгрузки = ТекущаяДата();
	 Док.Организация = ПараметрыСеанса.Пользователь.Организация; 
	 Док.Контрагент = ПараметрыСеанса.Контрагент;
	 
	 Для каждого стр из объект.Корзина цикл
		тт = док.ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(тт,стр);
		тт.ВидЦены = док.Контрагент.ТипЦены;
		тт.КоличествоУпаковок = тт.Количество;  
		тт.Цена = Стр.Цена;
		тт.Сумма = стр.Сумма;
		тт.СтавкаНДС = тт.Номенклатура.СтавкаНДС;  
		РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(тт, Док); 
	 КонецЦикла;          
		док.Сумма = док.ТЧТовары.Итог("Сумма");
	 Док.Комментарий = Нстр("fr = 'Créé automatiquement à partir de votre compte personnel'; ru = 'Создан автоматически из ЛКП'; en = 'Created automatically from paintwork'; es = 'Creado automáticamente desde LCP'"); 
	 док.АвторОбщий = ПараметрыСеанса.Пользователь;
	 Док.Ответственный = Док.Контрагент.Ответственный;
	Попытка
	 	Док.Записать(РежимЗаписиДокумента.Запись); 
	Исключение
	  ПодробностиОшибки = ОписаниеОшибки();
	  ЗаписьЖурналаРегистрации("Заказ покупателя из ЛКП",УровеньЖурналаРегистрации.Ошибка,Документы.ЗаказПокупателя,Док.Ссылка,ПодробностиОшибки);
	КонецПопытки;
		
	ЗапомнитьДинамическикорзину(Док.Ссылка);
	
	Объект.Корзина.Очистить();
	ЗаполнитьТаблицуЗаказов(); 
	ВывестиКорзину(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаказаПокупателя(Команда)
	ОформитьЗаказаПокупателяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоискОчистка(Элемент, СтандартнаяОбработка)   
	//СтандартнаяОбработка = ложь;
	//Поиск = "";  
		Результат = УдалитьОтбор(СписокНоменклатуры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Ссылка");
		Элементы.ДекорацияПустогоПоиска.Видимость = Ложь;
КонецПроцедуры  
	
&НаКлиенте
Процедура ПоискПриИзменении(Элемент)  
	Если СокрЛП(СтрокаПоиска) = "" тогда
		Элементы.ДекорацияПустогоПоиска.Видимость = Ложь;  
		//Результат = УдалитьОтбор(СписокНоменклатуры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Ссылка");
	Иначе
		//Элементы.ДекорацияПустогоПоиска.Видимость = Истина; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если СтрДлина(СокрЛП(Текст)) > 3 Тогда    
		ДанныеВыбора =  ППДНаСервере(СокрЛП(Текст));
		Результат = УдалитьОтбор(СписокНоменклатуры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Ссылка");
		ДобавитьОтбор(СписокНоменклатуры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Ссылка", ДанныеВыбора, ВидСравненияКомпоновкиДанных.ВСписке);	
		ЗаписатьОтборВИсторию(Неопределено);
	КонецЕсли;    
	
	Если СокрЛП(Текст) = "" тогда   
		Результат = УдалитьОтбор(СписокНоменклатуры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Ссылка");  
		Элементы.ДекорацияПустогоПоиска.Видимость = Ложь;
	КонецЕсли;	

	Если Элементы.СписокНоменклатуры.ТекущиеДанные = Неопределено тогда 
		
		Элементы.ДекорацияПустогоПоиска.Заголовок = Нстр("en = 'Leave a request to the manager to search for the product "+Текст+". Click here.'; es = 'Deje al gerente una solicitud para buscar el producto "+Текст+". Haga clic aquí.'; fr = 'Laissez une demande de recherche de produit "+Текст+" au gestionnaire. Cliquez ici.'; ru = 'Оставьте заявку на поиск товара "+Текст+" менеджеру. Нажмите здесь.'");
		Элементы.ДекорацияПустогоПоиска.ЦветТекста = WebЦвета.Красный;	
		Элементы.ДекорацияПустогоПоиска.Видимость = Истина;
		
	Иначе
		
		Элементы.ДекорацияПустогоПоиска.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры 


&НаСервере
Функция ППДНаСервере(СтрокаПоиска)    
	//ПолнотекстовыйПоиск.ОбновитьИндекс(истина, ложь);
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска, 100);
	СписокПоиска.ОбластьПоиска.Добавить(Метаданные.Справочники.Номенклатура);  
	СписокПоиска.ПорогНечеткости = 10;
	СписокПоиска.ПерваяЧасть();
	ДанныеВыбора = Новый СписокЗначений;
	Если СписокПоиска.Количество() Тогда
		Для Каждого ЭлементПоиска Из СписокПоиска Цикл
			ДанныеВыбора.Добавить(ЭлементПоиска.Значение, ЭлементПоиска.Представление + "; " + ЭлементПоиска.Описание);
		КонецЦикла;
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаПоиска", "%"+СтрокаПоиска+"%");
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 50
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.Наименование КАК Наименование,
	               |	Номенклатура.Артикул КАК Артикул,
	               |	Номенклатура.Код КАК Код
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	(Номенклатура.Наименование ПОДОБНО &СтрокаПоиска
	               |			ИЛИ Номенклатура.Артикул ПОДОБНО &СтрокаПоиска)";
	
	
	Выборка = Запрос.Выполнить().Выбрать();                                
	Пока Выборка.Следующий() Цикл
		Представление = Выборка.Наименование;
		ДанныеВыбора.Добавить(Выборка.Ссылка, Представление+ "; " +Выборка.Артикул);
	КонецЦикла; 
	// - 	
	
	возврат ДанныеВыбора;
КонецФункции


#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции   

&НаСервере
Процедура ВывестиКорзину()     
	
	ГруппаКорзины = Элементы.ГруппаКорзина;   
	ГруппаКорзиныСтр1 = Элементы.ГруппаКорзиныСтр1;
	
	ГруппаКорзиныСтр1.Заголовок = Нстр("fr = 'Liste de courses'; ru = 'Список покупок'; en = 'Shopping list'; es = 'Lista de compras'");
	ГруппаСписка = Элементы.ГруппаСписка;
	
	ГруппаКорзиныСтр2 = Элементы.ГруппаКорзиныСтр2;
	ГруппаКорзиныСтр2.Заголовок = Нстр("fr = 'Historique des achats'; ru = 'История заказов'; en = 'Order history'; es = 'Historial de pedidos'"); 
	
	Для сч = 0 по 10 цикл
		Для каждого эл из элементы цикл        
			Если СтрНайти(эл.Имя,"кор_") <> 0 Тогда 
				Элементы.Удалить(эл);
			КонецЕсли;	
		КонецЦикла; 
		Для каждого эл из ЭтаФорма.Команды цикл        
			Если СтрНайти(эл.Имя,"кор_") <> 0 Тогда 
				ЭтаФорма.Команды.Удалить(эл);
			КонецЕсли;	
		КонецЦикла; 
	КонецЦикла;         
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты(); 
	МассивУдаляемых = Новый Массив; 
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ИмяРеквизита = РеквизитФормы.Имя; 
		Если СтрНайти(ИмяРеквизита, "кор_") Тогда
			МассивУдаляемых.Добавить(ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.ИзменитьРеквизиты( , МассивУдаляемых);
	
	Если Объект.Корзина.Количество() = 0 Тогда     
		Элементы.ОформитьЗаказаПокупателя.Видимость = Ложь;
		Элементы.ДекорацияИТОГО.Заголовок = Нстр("fr = 'Marchandise 0 unité'; ru = 'Товаров 0 ед.'; en = 'There are 0 items.'; es = 'Productos 0 unidades'");      
		Элементы.ДекорацияКолТоваров.Видимость = Ложь;
		Элементы.ДекорацияЕдТовара.Видимость = Ложь;  
		Элементы.ДекорацияСумма.Видимость = Ложь;
	Иначе    
		Элементы.ОформитьЗаказаПокупателя.Видимость = Истина;   
		
		Элементы.ДекорацияКолТоваров.Видимость = Истина;
		Элементы.ДекорацияЕдТовара.Видимость = Истина;  
		Элементы.ДекорацияСумма.Видимость = Истина;
		
		элементы.ДекорацияИТОГО.Заголовок = Нстр("ru = 'Товаров '; fr = 'Marchandise '");
		Элементы.ДекорацияКолТоваров.Заголовок = Строка(Объект.Корзина.Итог("Количество"));
		Элементы.ДекорацияЕдТовара.Заголовок = Нстр("ru = ' ед. '; fr = ' unité '");  
		Элементы.ДекорацияСумма.Заголовок = Строка(Объект.Корзина.Итог("Сумма"));
	КонецЕсли;
	
	
		 
	Для каждого стр из объект.Корзина Цикл   
		
		
		ГруппаКнопок11 = ЭтаФорма.Элементы.Добавить("кор_ГруппаТов"+Строка(стр.НомерСтроки), Тип("ГруппаФормы"),ГруппаСписка);
		ГруппаКнопок11.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаКнопок11.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаКнопок11.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаКнопок11.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ДобавляемыеРеквизиты = Новый Массив; 
		НовыйРеквизит = Новый РеквизитФормы("кор_Картинка"+СокрЛП(стр.Номенклатура.Код),Новый ОписаниеТипов("Строка"));  
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);        
		НовыйРеквизит = Новый РеквизитФормы("кор_Номен"+СокрЛП(стр.Номенклатура.Код),Новый ОписаниеТипов("Строка"));  
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);        
		НовыйРеквизит = Новый РеквизитФормы("кор_Кол"+СокрЛП(стр.Номенклатура.Код),Новый ОписаниеТипов("Строка"));  
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);     
		НовыйРеквизит = Новый РеквизитФормы("кор_Сум"+СокрЛП(стр.Номенклатура.Код),Новый ОписаниеТипов("Строка"));  
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);    
		
		НоваяКомандаПлюс = ЭтаФорма.Команды.Добавить("кор_КомПлюс"+СокрЛП(стр.Номенклатура.Код));
		НоваяКомандаПлюс.Заголовок = "+"; 
		НоваяКомандаПлюс.Подсказка = "+1";
		НоваяКомандаПлюс.Действие = "ИзменитьКоличествоПлюс";        
		
		НоваяКомандаМинус = ЭтаФорма.Команды.Добавить("кор_КомМинус"+СокрЛП(стр.Номенклатура.Код));
		НоваяКомандаМинус.Заголовок = "-";
		НоваяКомандаМинус.Подсказка = "-1";
		НоваяКомандаМинус.Действие = "ИзменитьКоличествоМинус";  
		
		
		  	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("кор_Картинка"+СокрЛП(стр.Номенклатура.Код), Тип("ПолеФормы"),ГруппаКнопок11);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;   
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.ПутьКДанным = "кор_Картинка"+СокрЛП(стр.Номенклатура.Код);
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
			НовыйЭлемент.РазмерКартинки = РазмерКартинки.Пропорционально;
			НовыйЭлемент.Ширина = 5;
			НовыйЭлемент.Высота = 2;
			НовыйЭлемент.Рамка= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки); 
			
            ВывестиКартинкуНоменклатурыВКорзину(стр.Номенклатура, "кор_Картинка"+СокрЛП(стр.Номенклатура.Код));
		
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("кор_Номен"+СокрЛП(стр.Номенклатура.Код), Тип("ПолеФормы"),ГруппаКнопок11);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.ПутьКДанным = "кор_Номен"+СокрЛП(стр.Номенклатура.Код);
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
            НовыйЭлемент.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;  
			новыйЭлемент.Доступность = Ложь;
			
			ЭтотОбъект["кор_Номен"+СокрЛП(стр.Номенклатура.Код)]	=  СокрЛП(стр.Номенклатура.Наименование);
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("кор_КнопМинус"+СокрЛП(стр.Номенклатура.Код), Тип("КнопкаФормы"),ГруппаКнопок11);
			НовыйЭлемент.Заголовок = "-";  
			НовыйЭлемент.Шрифт = Новый Шрифт(, 12, Истина, , , ) ;
			НовыйЭлемент.ИмяКоманды = "кор_КомМинус"+СокрЛП(стр.Номенклатура.Код);
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("кор_Кол"+СокрЛП(стр.Номенклатура.Код), Тип("ПолеФормы"),ГруппаКнопок11);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;    
			НовыйЭлемент.ПутьКДанным = "кор_Кол"+СокрЛП(стр.Номенклатура.Код);
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;  
			новыйЭлемент.Шрифт = Новый Шрифт(, 12, Истина, , , ) ; 
			НовыйЭлемент.Ширина = 2;            
			НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			НовыйЭлемент.ЦветТекста = WebЦвета.Серый;
			
			ЭтотОбъект["кор_Кол"+СокрЛП(стр.Номенклатура.Код)]	= стр.Количество;
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("кор_КнопПлюс"+СокрЛП(стр.Номенклатура.Код), Тип("КнопкаФормы"),ГруппаКнопок11);
			НовыйЭлемент.Заголовок = "+";  
			НовыйЭлемент.Шрифт = Новый Шрифт(, 12, Истина, , , ) ;
			НовыйЭлемент.ИмяКоманды = "кор_КомПлюс"+СокрЛП(стр.Номенклатура.Код);
			
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("кор_Сум"+СокрЛП(стр.Номенклатура.Код), Тип("ПолеФормы"),ГруппаКнопок11);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;    
			НовыйЭлемент.ПутьКДанным = "кор_Сум"+СокрЛП(стр.Номенклатура.Код);
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;  
			новыйЭлемент.Шрифт = Новый Шрифт(, 14, Истина, , , ) ;  
			НовыйЭлемент.Ширина = 3;          
			НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
			НовыйЭлемент.ЦветТекста = WebЦвета.Серый;
			
			ЭтотОбъект["кор_Сум"+СокрЛП(стр.Номенклатура.Код)]	= стр.Сумма;
			
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТаблицуЗаказов() 
	
	Объект.ТаблицаЗаказов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Ссылка КАК ДокументЗаказа
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
	               |	И ЗаказПокупателя.Контрагент = &Контрагент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказПокупателя.Дата УБЫВ";
	Запрос.УстановитьПараметр("Контрагент",ПараметрыСеанса.Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		
		тт = объект.ТаблицаЗаказов.Добавить();
		ЗаполнитьЗначенияСвойств(тт,Выборка);  
		тт.КнопкаПовтора = Нстр("fr = 'Répéter'; ru = 'Повторить'; en = 'Repeat'; es = 'Repetir'");
		тт.КнопкаРазвернуть = Нстр("fr = 'Déployer'; ru = 'Развернуть'; en = 'Unwrap'; es = 'Desplegar'");
		тт.НомерЗаказа  = тт.ДокументЗаказа.Номер; 
		тт.ДатаЗаказа  = тт.ДокументЗаказа.Дата;     
		
		СтруктураВозврата = ЗаполнитьСуммыОплатыДолга(тт.ДокументЗаказа);
		
		Если СтруктураВозврата.СуммаОплаты = "0" тогда
			тт.КартинкаОплаты  = 2; 
		ИначеЕсли СтруктураВозврата.СуммаОплаты <> "0" 
			и СтруктураВозврата.СуммаДолга <> "0" тогда
			тт.КартинкаОплаты  = 1; 
		ИначеЕсли СтруктураВозврата.СуммаДолга = "0" тогда
			тт.КартинкаОплаты  = 0;     
		Иначе
			тт.КартинкаОплаты  = -1;     
		КонецЕсли;
		
			СтатусЗаказа =  Строка(РаботаСДокументамиВызовСервера.ПолучитьСтатусЗаказПокупателя(тт.ДокументЗаказа));
		Если СтатусЗаказа = "Новый" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Nouveau'; ru = 'Новый'; en = 'New'; es = 'Nuevo'");	 
		ИначеЕсли СтатусЗаказа = "В работе" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Dans le travail'; ru = 'В работе'; en = 'At work'; es = 'En el trabajo'");	
		ИначеЕсли СтатусЗаказа = "Собран" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Recueillit'; ru = 'Собран'; en = 'Assembled'; es = 'Recogiste'");	
		ИначеЕсли СтатусЗаказа = "Отгружен" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Expédias'; ru = 'Отгружен'; en = 'Shipped'; es = 'Envie'");	
		ИначеЕсли СтатусЗаказа = "Доставлен" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Livré'; ru = 'Доставлен'; en = 'Delivered'; es = 'Entregado'");	
        КонецЕсли;
		
		тт.СтатусЗаказа  = СтатусЗаказаСтр; 
		тт.Сумма  = тт.ДокументЗаказа.Сумма; 
		тт.Оплачено  = СтруктураВозврата.СуммаОплаты; 
		тт.Долг  = СтруктураВозврата.СуммаДолга; 
		
		
	КонецЦикла;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьКоличествоПлюс(Команда)
	
	КодНоменклатуры = СтрЗаменить(Команда.Имя,"кор_КомПлюс","");
	
	ИзменитьКоличествоПлюсНаСервере(КодНоменклатуры); 
	
КонецПроцедуры    

&НаСервере
Процедура ИзменитьКоличествоПлюсНаСервере(КодНоменклатуры)
	
	ПараметрыОтбора = Новый Структура();   
	ПараметрыОтбора.Вставить("Номенклатура",Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры));
	
	МассивСтрок = объект.Корзина.НайтиСтроки(ПараметрыОтбора);
	
	Для каждого стр из МассивСтрок цикл
		Стр.Количество = Стр.Количество+1;	
		Стр.Сумма = Стр.Количество*Стр.Цена;   
	КонецЦикла;  
	
	ЗапомнитьДинамическикорзину(Неопределено);
	
	ВывестиКорзину(); 
	
КонецПроцедуры 

&НаКлиенте   
Процедура ИзменитьКоличествоМинус(Команда)

 	КодНоменклатуры = СтрЗаменить(Команда.Имя,"кор_КомМинус","");
	
	ИзменитьКоличествоМинусНаСервере(КодНоменклатуры); 

КонецПроцедуры    

&НаСервере   
Процедура ИзменитьКоличествоМинусНаСервере(КодНоменклатуры)
	
	
	ПараметрыОтбора = Новый Структура();   
	ПараметрыОтбора.Вставить("Номенклатура",Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры));
	
	МассивСтрок = объект.Корзина.НайтиСтроки(ПараметрыОтбора);
	
	Для каждого стр из МассивСтрок цикл	
		Стр.Количество = Стр.Количество-1;	
		Стр.Сумма = Стр.Количество*Стр.Цена;  
		Если Стр.Количество = 0 тогда
			объект.Корзина.Удалить(стр);	
		КонецЕсли;
	КонецЦикла;   
	
	ЗапомнитьДинамическикорзину(Неопределено);	
	
	ВывестиКорзину(); 

КонецПроцедуры


&НаСервере
Процедура ВывестиКартинкуНоменклатурыВКорзину(СсылкаТовара, НаименРеквизита)
	
	НЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(СсылкаТовара.Ссылка);
	НЗ.Прочитать();   
	Для каждого стр из НЗ Цикл 
		Если стр.Расширение = "jpg" или стр.Расширение = "png" или стр.Расширение = "jpeg" Тогда
			ID = стр.ID;      
		КонецЕсли;
	КонецЦикла;     
	
	КлючЗаписиРег = РегистрыСведений.ПрисоединённыеФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,ID", СсылкаТовара.Ссылка,ID));
	Если ID = Неопределено Тогда
		ЭтотОбъект[НаименРеквизита]	= ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ПустаяКартинка,новый УникальныйИдентификатор);
	Иначе
		Если Не КлючЗаписиРег.Пустой() Тогда
			ЭтотОбъект[НаименРеквизита] = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные");  
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуГруппЛКП()

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	Номенклатура.Ссылка КАК ГруппаЛКП,
|	Номенклатура.Картинка КАК Картинка,
|	Номенклатура.Наименование КАК Наименование
|ИЗ
|	Справочник.Номенклатура КАК Номенклатура
|ГДЕ
|	Номенклатура.ЭтоГруппа = ИСТИНА
|	И Номенклатура.Родитель = &ПустойРодитель
|	И Номенклатура.ОтражатьвЛКП = ИСТИНА";
Запрос.УстановитьПараметр("ПустойРодитель",Справочники.Номенклатура.ПустаяСсылка());

возврат запрос.Выполнить().Выгрузить();
КонецФункции 

&НаСервере
Функция ПорционироватьКоллекцию(ИсходныйМассив, КоличествоЭлементовВПорции) 

МассивПорций = Новый Массив();
НовыйМассивСЧастями = Новый Массив();

Для Сч = 0 По ИсходныйМассив.Количество()-1 Цикл
	
	Если МассивПорций.Количество() = КоличествоЭлементовВПорции Тогда
		НовыйМассивСЧастями.Добавить(МассивПорций);
		МассивПорций = Новый Массив();
	КонецЕсли;
	
	МассивПорций.Добавить(ИсходныйМассив[Сч]);
	
КонецЦикла;

Если МассивПорций.Количество() > 0  Тогда
	НовыйМассивСЧастями.Добавить(МассивПорций);
КонецЕсли;

Возврат НовыйМассивСЧастями;

КонецФункции
#КонецОбласти

#Область УправлениеДинамическимСписком   

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	Для каждого стр из элементы.СписокНоменклатуры.ВыделенныеСтроки Цикл
		ДанныеСтроки =	Элементы.СписокНоменклатуры.ДанныеСтроки(стр);
		ЦенаНоменклатуры = ДанныеСтроки.Цена;  
		НаименованиеНоменклатуры = Строка(ДанныеСтроки.Ссылка); 
		ВывестиКартинкуНоменклатуры(ДанныеСтроки.Ссылка);
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура ВывестиКартинкуНоменклатуры(СсылкаТовара)
	
	НЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьНаборЗаписей();
	НЗ.Отбор.Объект.Установить(СсылкаТовара.Ссылка);
	НЗ.Прочитать();   
	Для каждого стр из НЗ Цикл 
		Если стр.Расширение = "jpg" или стр.Расширение = "png" или стр.Расширение = "jpeg" Тогда
			ID = стр.ID;      
		КонецЕсли;
	КонецЦикла;     
	
	КлючЗаписиРег = РегистрыСведений.ПрисоединённыеФайлы.СоздатьКлючЗаписи(Новый Структура("Объект,ID", СсылкаТовара.Ссылка,ID));
	
	Если ID = Неопределено Тогда
		СсылкаНаКартинку = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ПустаяКартинка,новый УникальныйИдентификатор);
	Иначе
		Если Не КлючЗаписиРег.Пустой() Тогда
			СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "Данные");  
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеПиктоГраммыКоманда(Элемент, СтандартнаяОбработка) 
СтандартнаяОбработка = Ложь;  

КодГруппы = СтрЗаменить(Элемент.Имя,"Картинка","");   

Попытка
	Для каждого эл из элементы Цикл 
		Если Эл.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда
			Если СтрНайти(эл.Имя,"Группа") <> 0 Тогда
				Если СтрНайти(эл.Имя,"РасширеннаяПодсказка") <> 0 Тогда 
					Продолжить;	
				КонецЕсли;
				эл.Отображение = ОтображениеОбычнойГруппы.Нет;	
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
Исключение
КонецПопытки;  

ПокраситьГруппыВыбора(Элемент.Родитель.Родитель.Имя);

Результат = УдалитьОтбор(СписокНоменклатуры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Код");

Если КодГруппы = "Все" Тогда Иначе
	СписокКодовОтбора = ПолучитьСписокКодовОтбора(КодГруппы);
	ДобавитьОтбор(СписокНоменклатуры.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Код", СписокКодовОтбора, ВидСравненияКомпоновкиДанных.ВСписке);	
КонецЕсли;

элементы.СписокНоменклатуры.Обновить();
ОбновитьОтображениеДанных();
КонецПроцедуры  

&НаСервере
Процедура ПокраситьГруппыВыбора(РодительИмя)

	Для каждого стр из ЭтаФорма.ТаблицаКодовРодителей цикл
		Элементы[стр.КодРодителя].ЦветФона = ЦветаСтиля.ЦветФонаФормы;	
	КонецЦикла;

	Элементы[РодительИмя].ЦветФона = ЦветаСтиля.ЦветАктивности;	

	тт = ЭтаФорма.ТаблицаКодовРодителей.Добавить();
	тт.КодРодителя = РодительИмя;

КонецПроцедуры  

&НаКлиенте
Функция ДобавитьОтбор(СписокОтборов, ИмяПоля, Значение, ВидСравнения = Неопределено, Использование = Истина)
НовыйЭлемент = СписокОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
НовыйЭлемент.ВидСравнения = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
НовыйЭлемент.ПравоеЗначение = Значение;
НовыйЭлемент.Использование = Использование;
Возврат НовыйЭлемент;
КонецФункции

&НаКлиенте
Функция УдалитьОтбор(СписокОтборов, ИмяПоля = "")
Если ПустаяСтрока(ИмяПоля) Тогда
СписокОтборов.Элементы.Очистить();
Возврат Истина;
КонецЕсли;
Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
ОтборУдален = Ложь;
Для каждого ЭлементОтбора Из СписокОтборов.Элементы Цикл
Если ЭлементОтбора.Использование И ЭлементОтбора.ЛевоеЗначение = Поле Тогда
	СписокОтборов.Элементы.Удалить(ЭлементОтбора);
	ОтборУдален = Истина;
КонецЕсли;
КонецЦикла;
Возврат ОтборУдален;
КонецФункции

&НаСервере
Функция ПолучитьСписокКодовОтбора(КодГруппы)   

ГруппаОтбора = Справочники.Номенклатура.НайтиПоКоду(КодГруппы);

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	Номенклатура.Код КАК Код,
|	Номенклатура.Наименование КАК Наименование
|ИЗ
|	Справочник.Номенклатура КАК Номенклатура
|ГДЕ
|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаОтбора)
|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
Запрос.УстановитьПараметр("ГруппаОтбора",ГруппаОтбора);

Выборка = запрос.Выполнить().Выбрать();

СписокКодовОтбора = новый СписокЗначений;

Пока Выборка.Следующий() цикл
	СписокКодовОтбора.Добавить(Выборка.Код);	
КонецЦикла;	

возврат СписокКодовОтбора; 

КонецФункции

&НаСервере
Процедура СписокНоменклатурыВыборНаСервере(ТекТовар, ТекЦена)    
	
	НоваяПозицияКорзины = Истина;
	
	Для каждого стр из Объект.Корзина цикл  
		Если Стр.Номенклатура = ТекТовар Тогда
			Стр.Количество = Стр.Количество+1;
			Стр.Цена = ТекЦена;
			Стр.Сумма = Стр.Количество*ТекЦена;   
			НоваяПозицияКорзины = Ложь;
		КонецЕсли;
	КонецЦикла;	  
	
	Если НоваяПозицияКорзины тогда
		НоваяСтрока = объект.Корзина.Добавить();
		НоваяСтрока.Номенклатура = ТекТовар;
		НоваяСтрока.Количество = 1;     
		НоваяСтрока.Цена = ТекЦена;
		НоваяСтрока.Сумма = ТекЦена; 
	КонецЕсли;
	
	ЗапомнитьДинамическикорзину(Неопределено);
	ЗаписатьОтборВИсторию(ТекТовар);
	ВывестиКорзину(); 
	
КонецПроцедуры   

&НаСервере
Процедура ОтобразимКорзинуИзДинамики()
	
	Объект.Корзина.Очистить();
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДинамическаяКорзинаЛКП.Номенклатура КАК Номенклатура,
	               |	ДинамическаяКорзинаЛКП.Количество КАК Количество,
	               |	ДинамическаяКорзинаЛКП.Цена КАК Цена,
	               |	ДинамическаяКорзинаЛКП.Сумма КАК Сумма
	               |ИЗ
	               |	РегистрСведений.ДинамическаяКорзинаЛКП КАК ДинамическаяКорзинаЛКП
	               |ГДЕ
	               |	ДинамическаяКорзинаЛКП.Пользователь = &Пользователь
	               |	И ДинамическаяКорзинаЛКП.ЗаказПокупателя = &ПустойЗаказ";
	Запрос.УстановитьПараметр("Пользователь",ИмяПользователя()); 
	Запрос.УстановитьПараметр("ПустойЗаказ",Документы.ЗаказПокупателя.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		НоваяСтр = объект.Корзина.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,Выборка);		
	КонецЦикла;
	
	ВывестиКорзину(); 
	
КонецПроцедуры 

&НаСервере
Процедура ЗапомнитьДинамическикорзину(Док = Неопределено)    
	
	Если Док = Неопределено тогда
		НаборЗаписей = РегистрыСведений.ДинамическаяКорзинаЛКП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ИмяПользователя());   
		НаборЗаписей.Отбор.ЗаказПокупателя.Установить(Документы.ЗаказПокупателя.ПустаяСсылка());   
		НаборЗаписей.Прочитать();  
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
		НаборЗаписей = РегистрыСведений.ДинамическаяКорзинаЛКП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ИмяПользователя());   
		НаборЗаписей.Отбор.ЗаказПокупателя.Установить(Документы.ЗаказПокупателя.ПустаяСсылка());  	
		Для каждого стр из объект.Корзина цикл
			Запись01 = НаборЗаписей.Добавить();   
			Запись01.Период = ТекущаяДата();		
			Запись01.Пользователь = ИмяПользователя();
			Запись01.Номенклатура = Стр.Номенклатура;
			Запись01.Количество = Стр.Количество;
			Запись01.Цена = Стр.Цена;
			Запись01.Сумма = Стр.Сумма;
		КонецЦикла; 
		
		НаборЗаписей.Записать(); 
	Иначе
		НаборЗаписей = РегистрыСведений.ДинамическаяКорзинаЛКП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ИмяПользователя());   
		НаборЗаписей.Отбор.ЗаказПокупателя.Установить(Документы.ЗаказПокупателя.ПустаяСсылка());   
		НаборЗаписей.Прочитать();  
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();  
		
		Для каждого стр из объект.Корзина цикл
			НоваяЗапись = РегистрыСведений.ДинамическаяКорзинаЛКП.СоздатьМенеджерЗаписи();
			НоваяЗапись.Период = ТекущаяДата();		
			НоваяЗапись.Пользователь = ИмяПользователя();
			НоваяЗапись.Номенклатура = Стр.Номенклатура; 
			НоваяЗапись.ЗаказПокупателя = Док; 	
			НоваяЗапись.Количество = Стр.Количество;
			НоваяЗапись.Цена = Стр.Цена;
			НоваяЗапись.Сумма = Стр.Сумма;
			НоваяЗапись.Записать(Истина);	
		КонецЦикла; 		
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СписокНоменклатурыВыборНаСервере(элементы.СписокНоменклатуры.ТекущиеДанные.Ссылка, элементы.СписокНоменклатуры.ТекущиеДанные.Цена);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПокупокНажатие(Элемент)
	ОткрытьФорму("Обработка.ЛичныйКабинетПартнера.Форма.ФормаИстории",,ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормы",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияФормы(ПараметрЗакрытия, ДополнительныеПараметры) Экспорт 
	Если ПараметрЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ОтобразимКорзинуИзДинамики();

КонецПроцедуры

&НаКлиенте
Процедура ПользовательЛПКНажатие(Элемент, СтандартнаяОбработка)   
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Обработка.ЛичныйКабинетПартнера.Форма.ФормаПользователя",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ГруппаКорзиныСтрПриСменеСтраницы(Элемент, ТекущаяСтраница)
//	Если ТекущаяСтраница.Имя = "ГруппаКорзиныСтр2" тогда    
//		
//		СформироватьИсториюЗаказов();
//		
//	КонецЕсли;
//КонецПроцедуры

//&НаСервере
//Процедура СформироватьИсториюЗаказов()    
//	
//	ТабДок.Очистить();
//	
//	МакетТД = Обработки.ЛичныйКабинетПартнера.ПолучитьМакет("Макет");  
//	
//	сч = 0;
//	Для каждого стр из объект.ТаблицаЗаказов Цикл 
//	сч = сч +1;	
//		Область4 = МакетТД.ПолучитьОбласть("Область4");
//    	ТабДок.Вывести(Область4);
//		
//		СтруктураВозврата = ЗаполнитьСуммыОплатыДолга(стр.ДокументЗаказа);

//		Область1 = МакетТД.ПолучитьОбласть("Область1");
//		Область1.Параметры.НомерЗ = стр.ДокументЗаказа.Номер;
//		Область1.Параметры.ДатаЗ   = Сред(Строка(стр.ДокументЗаказа.Дата),1,10);     
//		
//		Если СтруктураВозврата.СуммаОплаты = "0" тогда
//			Область1.Рисунки.D1.Картинка = БиблиотекаКартинок.НетОплаты;
//		ИначеЕсли СтруктураВозврата.СуммаОплаты <> "0" 
//			и СтруктураВозврата.СуммаДолга <> "0" тогда
//			Область1.Рисунки.D1.Картинка = БиблиотекаКартинок.ЧастичноОплачено;
//		ИначеЕсли СтруктураВозврата.СуммаДолга = "0" тогда
//			Область1.Рисунки.D1.Картинка = БиблиотекаКартинок.Оплачено; 
//		КонецЕсли;
//		
//		СтатусЗаказа =  Строка(РаботаСДокументамиВызовСервера.ПолучитьСтатусЗаказПокупателя(стр.ДокументЗаказа));
//		Если СтатусЗаказа = "Новый" Тогда
//			СтатусЗаказаСтр = Нстр("fr = 'Nouveau'; ru = 'Новый'; en = 'New'; es = 'Nuevo'");	 
//		ИначеЕсли СтатусЗаказа = "В работе" Тогда
//			СтатусЗаказаСтр = Нстр("fr = 'Dans le travail'; ru = 'В работе'; en = 'At work'; es = 'En el trabajo'");	
//		ИначеЕсли СтатусЗаказа = "Собран" Тогда
//			СтатусЗаказаСтр = Нстр("fr = 'Recueillit'; ru = 'Собран'; en = 'Assembled'; es = 'Recogiste'");	
//		ИначеЕсли СтатусЗаказа = "Отгружен" Тогда
//			СтатусЗаказаСтр = Нстр("fr = 'Expédias'; ru = 'Отгружен'; en = 'Shipped'; es = 'Envie'");	
//		ИначеЕсли СтатусЗаказа = "Доставлен" Тогда
//			СтатусЗаказаСтр = Нстр("fr = 'Livré'; ru = 'Доставлен'; en = 'Delivered'; es = 'Entregado'");	
//        КонецЕсли;
//			
//		Область1.Параметры.СтатусЗ =  СтатусЗаказаСтр;
//		Область1.Параметры.СуммаИЗ = стр.ДокументЗаказа.ТЧТовары.Итог("Сумма");
//    	ТабДок.Вывести(Область1); 
//		
//		Для каждого ном из стр.ДокументЗаказа.ТЧТовары Цикл
//    		Область2 = МакетТД.ПолучитьОбласть("Область2");
//			Область2.Параметры.АртикулЗ = ном.Номенклатура.Артикул;
//			Область2.Параметры.НоменклатураЗ   = Строка(ном.Номенклатура);
//			Область2.Параметры.КолвоЗ = Строка(ном.Количество);
//			Область2.Параметры.СуммаЗ = Строка(ном.Сумма);
//    		ТабДок.Вывести(Область2);  
//		КонецЦикла;  
//		
//		
//		Область3 = МакетТД.ПолучитьОбласть("Область3");  
//		Область3.Параметры.КнПовторить = Нстр("fr = 'Répéter'; ru = 'Повторить'; en = 'Repeat'; es = 'Repetir'");
//		Область3.Параметры.Расш = стр.ДокументЗаказа.Номер; 
//		Область3.Параметры.аа1 = Нстр("fr = 'Pour acquit:'; ru = 'Оплачено:'; en = 'Paid for:'; es = 'Pagado:'"); 
//		Область3.Параметры.аа2 = СтруктураВозврата.СуммаОплаты; 
//		Область3.Параметры.аа3 = Нстр("fr = 'Dette:'; ru = 'Долг:'; en = 'Debt:'; es = 'Deuda:'"); 
//		Область3.Параметры.аа4 = СтруктураВозврата.СуммаДолга; 
//		ТабДок.Вывести(Область3); 		  
//		
//	КонецЦикла;  					

//КонецПроцедуры   

&НаСервере
Функция ЗаполнитьСуммыОплатыДолга(объектСсылка)     
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуммаДолга",Строка(объектСсылка.Сумма));
	СтруктураВозврата.Вставить("СуммаОплаты","0");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчётыСПокупателями.ОбъектРасчётов КАК ОбъектРасчётов,
	|	ВзаиморасчётыСПокупателями.Сумма КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчётыСПокупателями КАК ВзаиморасчётыСПокупателями
	|ГДЕ
	|	ВзаиморасчётыСПокупателями.ОбъектРасчётов.Основание = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",объектСсылка);  
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
Если Выборка.Количество() = 0 Тогда иначе
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов КАК ОбъектРасчётов,
	|	ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(, ОбъектРасчётов.Основание = &Ссылка) КАК ВзаиморасчётыСПокупателямиОстатки";
	Запрос.УстановитьПараметр("Ссылка",объектСсылка);  
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	СуммаДолга = Выборка.Итог("Сумма");        
	СуммаОплаты  = объектСсылка.Сумма - Выборка.Итог("Сумма"); 
	
	
	СтруктураВозврата.СуммаДолга = ?(СуммаДолга = 0,"0",Строка(СуммаДолга));
	СтруктураВозврата.СуммаОплаты = ?(СуммаОплаты = 0,"0",Строка(СуммаОплаты));
КонецЕсли;

Возврат СтруктураВозврата;

КонецФункции 

//&НаКлиенте
//Процедура ТабДокВыбор(Элемент, Область, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	
//	Если Область.Текст = "Повторить" Тогда
//		
//		ПовторитьЗаказЛКПНаСервере(Область.Расшифровка);  
//		ПереходНаСтраницу = Элементы.ГруппаКорзиныСтр.ПодчиненныеЭлементы.Найти("ГруппаКорзиныСтр1");
//		ЭтаФорма.Элементы.ГруппаКорзиныСтр.ТекущаяСтраница = ПереходНаСтраницу; 
//		ОтобразимКорзинуИзДинамики();

//	КонецЕсли;	
//		
//КонецПроцедуры   

&НаСервере
Процедура ПовторитьЗаказЛКПНаСервере(НомЗаказа)
	
    Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЗаказПокупателяТЧТовары.Номенклатура КАК Номенклатура,
	                |	ЗаказПокупателяТЧТовары.Количество КАК Количество,
	                |	ЗаказПокупателяТЧТовары.Цена КАК Цена,
	                |	ЗаказПокупателяТЧТовары.Сумма КАК Сумма
	                |ИЗ
	                |	Документ.ЗаказПокупателя.ТЧТовары КАК ЗаказПокупателяТЧТовары
	                |ГДЕ
	                |	ЗаказПокупателяТЧТовары.Ссылка.Номер = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа",НомЗаказа);
	
	объект.Корзина.Очистить(); 
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		тт = объект.Корзина.Добавить();
		ЗаполнитьЗначенияСвойств(тт,выборка);
	КонецЦикла; 
	
	ЗапомнитьДинамическиКорзину();
	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	если поле.имя = "ТаблицаЗаказовКнопкаПовтора" Тогда  
		
		ПовторитьЗаказЛКПНаСервере(Элементы.ТаблицаЗаказов.ТекущиеДанные.НомерЗаказа);  
		ПереходНаСтраницу = Элементы.ГруппаКорзиныСтр.ПодчиненныеЭлементы.Найти("ГруппаКорзиныСтр1");
		ЭтаФорма.Элементы.ГруппаКорзиныСтр.ТекущаяСтраница = ПереходНаСтраницу; 
		ОтобразимКорзинуИзДинамики();    
		
	КонецЕсли;
	
	если поле.имя = "ТаблицаЗаказовКнопкаРазвернуть" Тогда  
		
		ТекСтрока = Элементы.ТаблицаЗаказов.ТекущиеДанные;
		Если ТекСтрока.Развернуто = ложь Тогда         
			
			ТекСтрока.КнопкаРазвернуть = Нстр("fr = 'Rouler'; ru = 'Свернуть'; en = 'Roll up'; es = 'Enrollar'"); 
			
			ТекСтрока.Развернуто = Истина;   
			
			ИндСтроки = ТекСтрока.НомерСтроки-1;   
			ИндСтрокиПустышки = 0;   

			ПолучитьТЗТовары(ТекСтрока.ДокументЗаказа);
			
			Для каждого стр из ТЗТовары цикл
				НовСтрВставка = Объект.ТаблицаЗаказов.Вставить(ИндСтроки); 
				НовСтрВставка.ИдСтроки = ИндСтроки+1;    
				НовСтрВставка.КартинкаОплаты = -1;  
				
				НовСтрВставка.СтатусЗаказа = стр.Артикул; 
				НовСтрВставка.Сумма = стр.Номенклатура;   
				НовСтрВставка.Оплачено = стр.Количество;  
				НовСтрВставка.Долг = стр.Сумма;    
				
				//ИндСтрокиПустышки = НовСтрВставка.НомерСтроки-1;   

				Объект.ТаблицаЗаказов.Сдвинуть(ИндСтроки, 1);   
			КонецЦикла;
			
			//НовСтрВставка = Объект.ТаблицаЗаказов.Вставить(ИндСтрокиПустышки); 
			//НовСтрВставка.ИдСтроки = ИндСтрокиПустышки+1;    
			//НовСтрВставка.КартинкаОплаты = -1;    
			//Объект.ТаблицаЗаказов.Сдвинуть(ИндСтрокиПустышки, 1);   
		Иначе
			
			ТекСтрока.КнопкаРазвернуть = Нстр("fr = 'Déployer'; ru = 'Развернуть'; en = 'Unwrap'; es = 'Desplegar'"); 
			
			ТекСтрока.Развернуто = ложь;   
			
			ИндСтроки = ТекСтрока.НомерСтроки;
			
			СтруктураДляПоиска = Новый Структура("ИдСтроки", ИндСтроки); 
			ТабличнаяЧастьДок = Объект.ТаблицаЗаказов; 
			МассивСтрок = ТабличнаяЧастьДок.НайтиСтроки(СтруктураДляПоиска); 
			Для каждого Строка Из МассивСтрок Цикл 
				ТабличнаяЧастьДок.Удалить(Строка); 
			КонецЦикла; 			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры    


&НаСервере
Процедура ПолучитьТЗТовары(ТекСтрокаДокументЗаказа)

	 Запрос = новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ЗаказПокупателяТЧТовары.Номенклатура.Артикул КАК Артикул,
	                |	ЗаказПокупателяТЧТовары.Номенклатура КАК Номенклатура,
	                |	ЗаказПокупателяТЧТовары.Количество КАК Количество,
	                |	ЗаказПокупателяТЧТовары.Сумма КАК Сумма
	                |ИЗ
	                |	Документ.ЗаказПокупателя.ТЧТовары КАК ЗаказПокупателяТЧТовары
	                |ГДЕ
	                |	ЗаказПокупателяТЧТовары.Ссылка = &Ссылка";
	 Запрос.УстановитьПараметр("Ссылка",ТекСтрокаДокументЗаказа);
	 
	Выборка = Запрос.Выполнить().Выгрузить(); 
	
	ТЗТовары.Очистить();
	
	Для каждого стр из Выборка цикл
		тт = ТЗТовары.Добавить();
		ЗаполнитьЗначенияСвойств(тт,стр);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПустогоПоискаНажатие(Элемент)   
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ПоисковыйЗапрос",СокрЛП(СтрокаПоиска));
	ОткрытьФорму("Обработка.ЛичныйКабинетПартнера.Форма.ФормаЗаявкиНаПоискТовара",ПараметрыФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыЗаявкиНаПоискТовара",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыЗаявкиНаПоискТовара(ПараметрЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ЗаполнитьТаблицуЗаявок(); 
	Элементы.ДекорацияПустогоПоиска.Заголовок = Нстр("fr = 'Demande de recherche de produits encadrée'; ru = 'Заявка на поиск товара оформлена'; en = 'The product search request has been completed'; es = 'Solicitud de búsqueda de productos formalizada'"); 
    Элементы.ДекорацияПустогоПоиска.ЦветТекста = WebЦвета.Зеленый;
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТаблицуЗаявок() 
	
	Объект.ТаблицаЗаявок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаНаПоискТовара.Ссылка КАК ДокументЗаявки
	               |ИЗ
	               |	Документ.ЗаявкаНаПоискТовара КАК ЗаявкаНаПоискТовара
	               |ГДЕ
	               |	ЗаявкаНаПоискТовара.ПометкаУдаления = ЛОЖЬ
	               |	И ЗаявкаНаПоискТовара.Ответственный = &Ответственный
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаявкаНаПоискТовара.Дата УБЫВ";
	Запрос.УстановитьПараметр("Ответственный",ПараметрыСеанса.Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		
		тт = объект.ТаблицаЗаявок.Добавить();
		ЗаполнитьЗначенияСвойств(тт,Выборка);  
		тт.НомерЗаявки  = тт.ДокументЗаявки.Номер; 
		тт.ДатаЗаявки  = тт.ДокументЗаявки.Дата;     
				
			СтатусЗаказа = Строка(тт.ДокументЗаявки.Статус);
		Если СтатусЗаказа = "Ожидает менеджера" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Attend le gestionnaire'; ru = 'Ожидает менеджера'; en = 'Waiting for the manager'; es = 'Espera gerente'");	 
		ИначеЕсли СтатусЗаказа = "Поиск" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Recherche'; ru = 'Поиск'; en = 'Search'; es = 'Búsqueda'");	
		ИначеЕсли СтатусЗаказа = "Отменена" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Proscrit'; ru = 'Отменена'; en = 'Cancelled'; es = 'Inválido'");	
		ИначеЕсли СтатусЗаказа = "Найдено" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Trouvé'; ru = 'Найдено'; en = 'Found'; es = 'Encontrado'");	
		ИначеЕсли СтатусЗаказа = "Не найдено" Тогда
			СтатусЗаказаСтр = Нстр("fr = 'Introuvable'; ru = 'Не найдено'; en = 'Not found'; es = 'No encontrado'");	
		КонецЕсли;
		
		тт.СтатусЗаявки  = СтатусЗаказаСтр; 		
		
	КонецЦикла;
	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьОтборВИсторию(Номенклат) 
	
			НоваяЗапись = РегистрыСведений.ИсторияПоискаВЛКП.СоздатьМенеджерЗаписи();
			НоваяЗапись.Период = ТекущаяДата();		
			НоваяЗапись.Автор = ПараметрыСеанса.Пользователь; 
			НоваяЗапись.Контрагент = ПараметрыСеанса.Контрагент; 
			НоваяЗапись.Номенклатура = Номенклат; 
			НоваяЗапись.ТекстПоиска = СокрЛП(ЭтаФорма.СтрокаПоиска); 	
			НоваяЗапись.Записать(Ложь);
			
КонецПроцедуры 

#КонецОбласти 
// -GAN  29/10/2025
